README.md


<a id="orga8e13fb"></a>

# Tests

To run tests: run in a terminal the following `python tests/unit_tests.py`


<a id="orgf7dc133"></a>

# Next steps

-   Add a way to configure data for SCPIs
-   Add manual assets, e.g. Deposit account
-   Import operations from csv, pdf

